jcatki/micropython/ports/esp32/boards/HELTEC_WIFI_KIT_32/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Heltec WIFI Kit 32"
#define MICROPY_HW_MCU_NAME "ESP32"
